gettobyte/GB_ElecronicsV_S32K144_Autosar_MCAL/Peripherals/FlexTImer/MCAL_Demo_Codes/G2B_FlexTimer_CenterAlign_PWM/RTD/include/Clock_Ip_Specific.h
/*==================================================================================================
*   Project              : RTD AUTOSAR 4.4
*   Platform             : CORTEXM
*   Peripheral           : 
*   Dependencies         : none
*
*   Autosar Version      : 4.4.0
*   Autosar Revision     : ASR_REL_4_4_REV_0000
*   Autosar Conf.Variant :
*   SW Version           : 1.0.1
*   Build Version        : S32K1_RTD_1_0_1_D2202_ASR_REL_4_4_REV_0000_20220224
*
*   (c) Copyright 2020-2022 NXP Semiconductors
*   All Rights Reserved.
*
*   NXP Confidential. This software is owned or controlled by NXP and may only be
*   used strictly in accordance with the applicable license terms. By expressly
*   accepting such terms or by downloading, installing, activating and/or otherwise
*   using the software, you are agreeing that you have read, and that you agree to
*   comply with and are bound by, such license terms. If you do not agree to be
*   bound by the applicable license terms, then you may not retain, install,
*   activate or otherwise use the software.
==================================================================================================*/

#ifndef CLOCK_IP_SPECIFIC_H
#define CLOCK_IP_SPECIFIC_H

/**
*   @file    Clock_Ip_Specific.h
*   @version    1.0.1
*
*   @brief   CLOCK IP specific header file.
*   @details CLOCK IP specific header file.

*   @addtogroup CLOCK_DRIVER Clock Ip Driver
*   @{
*/

#if defined(__cplusplus)
extern "C"{
#endif
/*==================================================================================================
*                                          INCLUDE FILES
* 1) system and project includes
* 2) needed interfaces from external units
* 3) internal and external interfaces from this unit
==================================================================================================*/
#include "Clock_Ip_Cfg_Defines.h"

#if defined (CLOCK_IP_S32K148)
#include "S32K148_SIM.h"
#include "S32K148_SCG.h"
#include "S32K148_PCC.h"
#include "S32K148_SMC.h"
#include "S32K148_QUADSPI.h"

#elif defined (CLOCK_IP_S32K116)
#include "S32K116_SIM.h"
#include "S32K116_SCG.h"
#include "S32K116_PCC.h"
#include "S32K116_SMC.h"
#include "S32K116_CMU.h"

#elif defined (CLOCK_IP_S32K118)
#include "S32K118_SIM.h"
#include "S32K118_SCG.h"
#include "S32K118_PCC.h"
#include "S32K118_SMC.h"
#include "S32K118_CMU.h"

#elif defined (CLOCK_IP_S32K142)
#include "S32K142_SIM.h"
#include "S32K142_SCG.h"
#include "S32K142_PCC.h"
#include "S32K142_SMC.h"

#elif defined (CLOCK_IP_S32K142W)
#include "S32K142W_SIM.h"
#include "S32K142W_SCG.h"
#include "S32K142W_PCC.h"
#include "S32K142W_SMC.h"

#elif defined (CLOCK_IP_S32K144)
#include "S32K144_SIM.h"
#include "S32K144_SCG.h"
#include "S32K144_PCC.h"
#include "S32K144_SMC.h"

#elif defined (CLOCK_IP_S32K144W)
#include "S32K144W_SIM.h"
#include "S32K144W_SCG.h"
#include "S32K144W_PCC.h"
#include "S32K144W_SMC.h"

#elif defined (CLOCK_IP_S32K146)
#include "S32K146_SIM.h"
#include "S32K146_SCG.h"
#include "S32K146_PCC.h"
#include "S32K146_SMC.h"

#endif

#include "Mcal.h"

/*==================================================================================================
                               SOURCE FILE VERSION INFORMATION
==================================================================================================*/
#define CLOCK_IP_SPECIFIC_VENDOR_ID                       43
#define CLOCK_IP_SPECIFIC_AR_RELEASE_MAJOR_VERSION        4
#define CLOCK_IP_SPECIFIC_AR_RELEASE_MINOR_VERSION        4
#define CLOCK_IP_SPECIFIC_AR_RELEASE_REVISION_VERSION     0
#define CLOCK_IP_SPECIFIC_SW_MAJOR_VERSION                1
#define CLOCK_IP_SPECIFIC_SW_MINOR_VERSION                0
#define CLOCK_IP_SPECIFIC_SW_PATCH_VERSION                1

/*==================================================================================================
                                      FILE VERSION CHECKS
==================================================================================================*/
/* Check if Clock_Ip_Specific.h file and Clock_Ip_Cfg_Defines.h file are of the same vendor */
#if (CLOCK_IP_SPECIFIC_VENDOR_ID != CLOCK_IP_CFG_DEFINES_VENDOR_ID)
    #error "Clock_Ip_Specific.h and Clock_Ip_Cfg_Defines.h have different vendor ids"
#endif

/* Check if Clock_Ip_Specific.h file and Clock_Ip_Cfg_Defines.h file are of the same Autosar version */
#if ((CLOCK_IP_SPECIFIC_AR_RELEASE_MAJOR_VERSION != CLOCK_IP_CFG_DEFINES_AR_RELEASE_MAJOR_VERSION) || \
     (CLOCK_IP_SPECIFIC_AR_RELEASE_MINOR_VERSION != CLOCK_IP_CFG_DEFINES_AR_RELEASE_MINOR_VERSION) || \
     (CLOCK_IP_SPECIFIC_AR_RELEASE_REVISION_VERSION != CLOCK_IP_CFG_DEFINES_AR_RELEASE_REVISION_VERSION) \
    )
    #error "AutoSar Version Numbers of Clock_Ip_Specific.h and Clock_Ip_Cfg_Defines.h are different"
#endif

/* Check if Clock_Ip_Specific.h file and Clock_Ip_Cfg_Defines.h file are of the same Software version */
#if ((CLOCK_IP_SPECIFIC_SW_MAJOR_VERSION != CLOCK_IP_CFG_DEFINES_SW_MAJOR_VERSION) || \
     (CLOCK_IP_SPECIFIC_SW_MINOR_VERSION != CLOCK_IP_CFG_DEFINES_SW_MINOR_VERSION) || \
     (CLOCK_IP_SPECIFIC_SW_PATCH_VERSION != CLOCK_IP_CFG_DEFINES_SW_PATCH_VERSION) \
    )
    #error "Software Version Numbers of Clock_Ip_Specific.h and Clock_Ip_Cfg_Defines.h are different"
#endif

#ifndef DISABLE_MCAL_INTERMODULE_ASR_CHECK
/* Check if Clock_Ip_Specific.h file and Mcal.h file are of the same Autosar version */
#if ((CLOCK_IP_SPECIFIC_AR_RELEASE_MAJOR_VERSION    != MCAL_AR_RELEASE_MAJOR_VERSION) || \
     (CLOCK_IP_SPECIFIC_AR_RELEASE_MINOR_VERSION    != MCAL_AR_RELEASE_MINOR_VERSION))
    #error "AutoSar Version Numbers of Clock_Ip_Specific.h and Mcal.h are different"
#endif
#endif

/*==================================================================================================
*                                            CONSTANTS
==================================================================================================*/

/*==================================================================================================
*                                       DEFINES AND MACROS
==================================================================================================*/
#if (defined (CLOCK_IP_S32K118) || defined(CLOCK_IP_S32K116))

    #define CLOCK_IP_DIVIDER_CALLBACKS_COUNT                                               11U
    #define CLOCK_IP_SCG_ASYNC_DIV1                                                        1U
    #define CLOCK_IP_SCG_ASYNC_DIV2                                                        2U
    #define CLOCK_IP_SCG_DIVCORE_RUN                                                       3U
    #define CLOCK_IP_SCG_DIVBUS_RUN                                                        4U
    #define CLOCK_IP_SCG_DIVSLOW_RUN                                                       5U
    #define CLOCK_IP_SCG_DIVCORE_VLPR                                                      6U
    #define CLOCK_IP_SCG_DIVBUS_VLPR                                                       7U
    #define CLOCK_IP_SCG_DIVSLOW_VLPR                                                      8U
    #define CLOCK_IP_SIM_CLKOUT_DIV                                                        9U
    #define CLOCK_IP_PCC_PCD_FRAC                                                          10U

    #define CLOCK_IP_DIVIDERTRIGGER_CALLBACKS_COUNT                                        1U

    #define CLOCK_IP_XOSC_CALLBACKS_COUNT                                                  2U
    #define CLOCK_IP_SOSC_ENABLE                                                           1U

    #define CLOCK_IP_IRCOSC_CALLBACKS_COUNT                                                5U
    #define CLOCK_IP_SIRC_ENABLE                                                           1U
    #define CLOCK_IP_SIRC_VLP_ENABLE                                                       2U
    #define CLOCK_IP_SIRC_STOP_ENABLE                                                      3U
    #define CLOCK_IP_FIRC_ENABLE                                                           4U

    #define CLOCK_IP_GATE_CALLBACKS_COUNT                                                  6U
    #define CLOCK_IP_PCC_CGC_ENABLE                                                        1U
    #define CLOCK_IP_SIM_CLKOUT_ENABLE                                                     2U
    #define CLOCK_IP_SIM_LPO32K_ENABLE                                                     3U
    #define CLOCK_IP_SIM_LPO1K_ENABLE                                                      4U
    #define CLOCK_IP_SIM_PLATCGC_CGC                                                       5U

    #define CLOCK_IP_FRACTIONAL_DIVIDER_CALLBACKS_COUNT                                    1U
	#define CLOCK_IP_NUMBER_OF_HARDWARE_DFS                                                0U

    #define CLOCK_IP_PLL_CALLBACKS_COUNT                                                   1U

    #define CLOCK_IP_SELECTOR_CALLBACKS_COUNT                                              9U
    #define CLOCK_IP_SCG_SCS_RUN_SEL                                                       1U
    #define CLOCK_IP_SCG_SCS_VLPR_SEL                                                      2U
    #define CLOCK_IP_SIM_RTC_SEL                                                           3U
    #define CLOCK_IP_SIM_LPO_SEL                                                           4U
    #define CLOCK_IP_SCG_CLKOUT_SEL                                                        5U
    #define CLOCK_IP_SIM_FTMOPT_SEL                                                        6U
    #define CLOCK_IP_SIM_CLKOUT_SEL                                                        7U
    #define CLOCK_IP_PCC_PCS_SELECT                                                        8U

    #define CLOCK_IP_PCFS_CALLBACKS_COUNT                                                  1U

    #define CLOCK_IP_CMU_CALLBACKS_COUNT                                                   2U
    #define CLOCK_IP_CMU_FC_FCE_REF_CNT_LFREF_HFREF                                        1U

    #define CLOCK_IP_ALL_CALLBACKS_COUNT                                                   11U

#elif (defined (CLOCK_IP_S32K142W) || defined(CLOCK_IP_S32K144W))

    #define CLOCK_IP_DIVIDER_CALLBACKS_COUNT                                               12U
    #define CLOCK_IP_SCG_ASYNC_DIV1                                                        1U
    #define CLOCK_IP_SCG_ASYNC_DIV2                                                        2U
    #define CLOCK_IP_SCG_DIVCORE_RUN                                                       3U
    #define CLOCK_IP_SCG_DIVBUS_RUN                                                        4U
    #define CLOCK_IP_SCG_DIVSLOW_RUN                                                       5U
    #define CLOCK_IP_SCG_DIVCORE_VLPR                                                      6U
    #define CLOCK_IP_SCG_DIVBUS_VLPR                                                       7U
    #define CLOCK_IP_SCG_DIVSLOW_VLPR                                                      8U
    #define CLOCK_IP_SIM_CLKOUT_DIV                                                        9U
    #define CLOCK_IP_PCC_PCD_FRAC                                                          10U
    #define CLOCK_IP_SIM_TRACE_DIV_MUL                                                     11U

    #define CLOCK_IP_DIVIDERTRIGGER_CALLBACKS_COUNT                                        1U

    #define CLOCK_IP_XOSC_CALLBACKS_COUNT                                                  2U
    #define CLOCK_IP_SOSC_ENABLE                                                           1U

    #define CLOCK_IP_IRCOSC_CALLBACKS_COUNT                                                5U
    #define CLOCK_IP_SIRC_ENABLE                                                           1U
    #define CLOCK_IP_SIRC_VLP_ENABLE                                                       2U
    #define CLOCK_IP_SIRC_STOP_ENABLE                                                      3U
    #define CLOCK_IP_FIRC_ENABLE                                                           4U

    #define CLOCK_IP_GATE_CALLBACKS_COUNT                                                  7U
    #define CLOCK_IP_PCC_CGC_ENABLE                                                        1U
    #define CLOCK_IP_SIM_CLKOUT_ENABLE                                                     2U
    #define CLOCK_IP_SIM_LPO32K_ENABLE                                                     3U
    #define CLOCK_IP_SIM_LPO1K_ENABLE                                                      4U
    #define CLOCK_IP_SIM_PLATCGC_CGC                                                       5U
    #define CLOCK_IP_SIM_TRACE_ENABLE                                                      6U

    #define CLOCK_IP_FRACTIONAL_DIVIDER_CALLBACKS_COUNT                                    1U
    #define CLOCK_IP_NUMBER_OF_HARDWARE_DFS                                                0U

    #define CLOCK_IP_PLL_CALLBACKS_COUNT                                                   2U
    #define CLOCK_IP_SPLL_ENABLE                                                           1U

    #define CLOCK_IP_SELECTOR_CALLBACKS_COUNT                                              10U
    #define CLOCK_IP_SCG_SCS_RUN_SEL                                                       1U
    #define CLOCK_IP_SCG_SCS_VLPR_SEL                                                      2U
    #define CLOCK_IP_SIM_RTC_SEL                                                           3U
    #define CLOCK_IP_SIM_LPO_SEL                                                           4U
    #define CLOCK_IP_SCG_CLKOUT_SEL                                                        5U
    #define CLOCK_IP_SIM_FTMOPT_SEL                                                        6U
    #define CLOCK_IP_SIM_CLKOUT_SEL                                                        7U
    #define CLOCK_IP_PCC_PCS_SELECT                                                        8U
    #define CLOCK_IP_SIM_TRACE_SEL                                                         9U

    #define CLOCK_IP_PCFS_CALLBACKS_COUNT                                                  1U

    #define CLOCK_IP_CMU_CALLBACKS_COUNT                                                   1U

    #define CLOCK_IP_ALL_CALLBACKS_COUNT                                                   12U

#elif (defined (CLOCK_IP_S32K142) || defined(CLOCK_IP_S32K144) || defined(CLOCK_IP_S32K146) || defined(CLOCK_IP_S32K148))

    #define CLOCK_IP_DIVIDER_CALLBACKS_COUNT                                               15U
    #define CLOCK_IP_SCG_ASYNC_DIV1                                                        1U
    #define CLOCK_IP_SCG_ASYNC_DIV2                                                        2U
    #define CLOCK_IP_SCG_DIVCORE_RUN                                                       3U
    #define CLOCK_IP_SCG_DIVBUS_RUN                                                        4U
    #define CLOCK_IP_SCG_DIVSLOW_RUN                                                       5U
    #define CLOCK_IP_SCG_DIVCORE_VLPR                                                      6U
    #define CLOCK_IP_SCG_DIVBUS_VLPR                                                       7U
    #define CLOCK_IP_SCG_DIVSLOW_VLPR                                                      8U
    #define CLOCK_IP_SCG_DIVCORE_HSRUN                                                     9U
    #define CLOCK_IP_SCG_DIVBUS_HSRUN                                                      10U
    #define CLOCK_IP_SCG_DIVSLOW_HSRUN                                                     11U
    #define CLOCK_IP_SIM_CLKOUT_DIV                                                        12U
    #define CLOCK_IP_PCC_PCD_FRAC                                                          13U
    #define CLOCK_IP_SIM_TRACE_DIV_MUL                                                     14U

    #define CLOCK_IP_DIVIDERTRIGGER_CALLBACKS_COUNT                                        1U

    #define CLOCK_IP_XOSC_CALLBACKS_COUNT                                                  2U
    #define CLOCK_IP_SOSC_ENABLE                                                           1U

    #define CLOCK_IP_IRCOSC_CALLBACKS_COUNT                                                5U
    #define CLOCK_IP_SIRC_ENABLE                                                           1U
    #define CLOCK_IP_SIRC_VLP_ENABLE                                                       2U
    #define CLOCK_IP_SIRC_STOP_ENABLE                                                      3U
    #define CLOCK_IP_FIRC_ENABLE                                                           4U

    #define CLOCK_IP_GATE_CALLBACKS_COUNT                                                  7U
    #define CLOCK_IP_PCC_CGC_ENABLE                                                        1U
    #define CLOCK_IP_SIM_CLKOUT_ENABLE                                                     2U
    #define CLOCK_IP_SIM_LPO32K_ENABLE                                                     3U
    #define CLOCK_IP_SIM_LPO1K_ENABLE                                                      4U
    #define CLOCK_IP_SIM_PLATCGC_CGC                                                       5U
    #define CLOCK_IP_SIM_TRACE_ENABLE                                                      6U

    #define CLOCK_IP_FRACTIONAL_DIVIDER_CALLBACKS_COUNT                                    1U
    #define CLOCK_IP_NUMBER_OF_HARDWARE_DFS                                                0U

    #define CLOCK_IP_PLL_CALLBACKS_COUNT                                                   2U
    #define CLOCK_IP_SPLL_ENABLE                                                           1U

