gettobyte/GB_ElecronicsV_S32K144_Autosar_MCAL/Peripherals/FlexTImer/MCAL_Demo_Codes/G2B_FlexTimer_CenterAlign_PWM/RTD/include/Clock_Ip_Specific.h
    #define CLOCK_IP_SELECTOR_CALLBACKS_COUNT                                              11U
    #define CLOCK_IP_SCG_SCS_RUN_SEL                                                       1U
    #define CLOCK_IP_SCG_SCS_VLPR_SEL                                                      2U
    #define CLOCK_IP_SCG_SCS_HSRUN_SEL                                                     3U
    #define CLOCK_IP_SIM_RTC_SEL                                                           4U
    #define CLOCK_IP_SIM_LPO_SEL                                                           5U
    #define CLOCK_IP_SCG_CLKOUT_SEL                                                        6U
    #define CLOCK_IP_SIM_FTMOPT_SEL                                                        7U
    #define CLOCK_IP_SIM_CLKOUT_SEL                                                        8U
    #define CLOCK_IP_PCC_PCS_SELECT                                                        9U
    #define CLOCK_IP_SIM_TRACE_SEL                                                         10U

    #define CLOCK_IP_PCFS_CALLBACKS_COUNT                                                  1U

    #define CLOCK_IP_CMU_CALLBACKS_COUNT                                                   1U

    #define CLOCK_IP_ALL_CALLBACKS_COUNT                                                   15U

#endif

/* The source of HCLK is CORE_CLK. */
#define HCLK        CORE_CLK

#if (defined(CLOCK_IP_S32K116) || defined(CLOCK_IP_S32K118))
#define CLOCK_IP_PERIPH_ASYNC_COUNT          3U
#else
#define CLOCK_IP_PERIPH_ASYNC_COUNT             4U
#endif

#if (defined(CLOCK_IP_S32K116) || defined(CLOCK_IP_S32K118))
#define CLOCK_IP_NUMBER_OF_HARDWARE_PLL      0U
#define CLOCK_IP_CMU_INSTANCES_ARRAY_SIZE    2U
#define CLOCK_IP_CMU_INFO_SIZE               2U
#else
#define CLOCK_IP_NUMBER_OF_HARDWARE_PLL      1U
#define CLOCK_IP_CMU_INSTANCES_ARRAY_SIZE    0U
#define CLOCK_IP_CMU_INFO_SIZE               0U
#endif

#ifdef CMU_GCR_FCE_MASK
    #define CMU_FC_GCR_FCE_MASK CMU_GCR_FCE_MASK
#endif
#ifdef CMU_GCR_FCE_SHIFT
    #define CMU_FC_GCR_FCE_SHIFT CMU_GCR_FCE_SHIFT
#endif
#ifdef CMU_IER_FHHAIE_MASK
    #define CMU_FC_IER_FHHAIE_MASK CMU_IER_FHHAIE_MASK
#endif
#ifdef CMU_IER_FHHIE_MASK
    #define CMU_FC_IER_FHHIE_MASK CMU_IER_FHHIE_MASK
#endif
#ifdef CMU_IER_FLLAIE_MASK
    #define CMU_FC_IER_FLLAIE_MASK CMU_IER_FLLAIE_MASK
#endif
#ifdef CMU_IER_FLLIE_MASK
    #define CMU_FC_IER_FLLIE_MASK CMU_IER_FLLIE_MASK
#endif
#ifdef CMU_SR_FHH_MASK
    #define CMU_FC_SR_FHH_MASK CMU_SR_FHH_MASK
#endif
#ifdef CMU_SR_FLL_MASK
    #define CMU_FC_SR_FLL_MASK CMU_SR_FLL_MASK
#endif
#ifdef CMU_SR_RS_MASK
    #define CMU_FC_SR_RS_MASK CMU_SR_RS_MASK
#endif

#ifdef CLOCK_IP_CMU_FC_FCE_REF_CNT_LFREF_HFREF
#define CLOCK_IP_CMU_FREQUENCY_CHECK_ENABLED          CMU_FC_GCR_FCE_MASK
#define CLOCK_IP_CMU_FREQUENCY_CHECK_STOPPED          0U
#define CLOCK_IP_CMU_ISR_MASK                         3U
#define CMU_RESET_COUNTER_VALUE              0U
#define CMU_RESET_LOW_LIMIT                  3U
#define CMU_RESET_HIGH_LIMIT                 0x00FFFFFCU
#endif

/*==================================================================================================
*                                              ENUMS
==================================================================================================*/

/*==================================================================================================
*                                  STRUCTURES AND OTHER TYPEDEFS
==================================================================================================*/
typedef struct {

    uint32  ASYNC_DIV;    /* Peripheral asynchronous clock register */

}Clock_Ip_ScgPeriphAsyncDivType;

#if defined(CLOCK_IP_HAS_FIRC_MON1_CLK) || defined(CLOCK_IP_HAS_FIRC_MON2_CLK)
/** CMU - Register Layout Typedef */
typedef struct {
  uint32 GCR;                               /**< Global Configuration Register, offset: 0x0 */
  uint32 RCCR;                              /**< Reference Count Configuration Register, offset: 0x4 */
  uint32 HTCR;                              /**< High Threshold Configuration Register, offset: 0x8 */
  uint32 LTCR;                              /**< Low Threshold Configuration Register, offset: 0xC */
  volatile uint32 SR;                                /**< Status Register, offset: 0x10 */
  uint32 IER;                               /**< Interrupt Enable Register, offset: 0x14 */

} Clock_Ip_ClockMonitorType;

typedef struct{

    Clock_Ip_NameType Name;       /* Name of the clock that can be monitored/supports cmu (clock monitor) */
    Clock_Ip_NameType Reference;  /* Name of the reference clock */
    Clock_Ip_NameType Bus;        /* Name of the bus clock */

    Clock_Ip_ClockMonitorType* CmuInstance;

}Clock_Ip_CmuInfoType;
#endif


/*==================================================================================================
*                                  GLOBAL VARIABLE DECLARATIONS
==================================================================================================*/
/* Clock start constant section data */
#define MCU_START_SEC_CONST_UNSPECIFIED
#include "Mcu_MemMap.h"

extern volatile  Clock_Ip_ScgPeriphAsyncDivType* const Clock_Ip_apxScgPeriphAsyncDivs[CLOCK_IP_PERIPH_ASYNC_COUNT];
#if CLOCK_IP_CMU_INSTANCES_ARRAY_SIZE > 0U
extern Clock_Ip_ClockMonitorType * const Clock_Ip_apxCmu[CLOCK_IP_CMU_INSTANCES_ARRAY_SIZE];
extern Clock_Ip_NameType const Clock_Ip_aeCmuNames[CLOCK_IP_CMU_INSTANCES_ARRAY_SIZE];
#endif

#if CLOCK_IP_CMU_INFO_SIZE > 0U
extern const Clock_Ip_CmuInfoType Clock_Ip_axCmuInfo[CLOCK_IP_CMU_INFO_SIZE];
#endif
/* Clock stop constant section data */
#define MCU_STOP_SEC_CONST_UNSPECIFIED
#include "Mcu_MemMap.h"

/* Clock start constant section data */
#define MCU_START_SEC_CONST_16
#include "Mcu_MemMap.h"

extern const uint8 Clock_Ip_au16SelectorEntryHardwareValue[CLOCK_IP_FEATURE_NAMES_NO];
extern const uint8 Clock_Ip_au8SelectorEntryScsHardwareValue[CLOCK_IP_FEATURE_PRODUCERS_NO + 1U];
extern const uint8 Clock_Ip_au8SelectorEntryPcsHardwareValue[CLOCK_IP_FEATURE_PRODUCERS_NO + 1U];
extern const uint8 Clock_Ip_au8DividerValueHardwareValue[65U];

/* Clock stop constant section data */
#define MCU_STOP_SEC_CONST_16
#include "Mcu_MemMap.h"

/*==================================================================================================
*                                       FUNCTION PROTOTYPES
==================================================================================================*/

/* Clock start section code */
#define MCU_START_SEC_CODE
#include "Mcu_MemMap.h"

#if defined(CLOCK_IP_HAS_FIRC_MON1_CLK)
void Clock_Ip_EnableCmu0Gate_TrustedCall(void);
#endif

#if defined(CLOCK_IP_HAS_FIRC_MON2_CLK)
void Clock_Ip_EnableCmu1Gate_TrustedCall(void);
#endif

/* Clock stop section code */
#define MCU_STOP_SEC_CODE
#include "Mcu_MemMap.h"
#if defined(__cplusplus)
}
#endif /* __cplusplus*/


/*! @}*/

#endif /* CLOCK_IP_SPECIFIC_H */

